k6/results/smoke-full-v2-output.txt

         /\      Grafana   /ÔÇ¥ÔÇ¥/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ÔÇ¥ÔÇ¥\ 
  /          \   |   (  |  (ÔÇ¥)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: F:\Work\Hadha.co\Project\k6\smoke\full-suite.js
        output: -

     scenarios: (100.00%) 1 scenario, 2 max VUs, 2m30s max duration (incl. graceful stop):
              * default: 2 looping VUs for 2m0s (gracefulStop: 30s)


running (0m01.0s), 2/2 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 2 VUs  0m01.0s/2m0s

running (0m02.0s), 2/2 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 2 VUs  0m02.0s/2m0s

running (0m03.0s), 2/2 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 2 VUs  0m03.0s/2m0s

running (0m04.0s), 2/2 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 2 VUs  0m04.0s/2m0s

running (0m05.0s), 2/2 VUs, 0 complete and 0 interrupted iterations
default   [   4% ] 2 VUs  0m05.0s/2m0s

running (0m06.0s), 2/2 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 2 VUs  0m06.0s/2m0s

running (0m07.0s), 2/2 VUs, 0 complete and 0 interrupted iterations
default   [   6% ] 2 VUs  0m07.0s/2m0s

running (0m08.0s), 2/2 VUs, 0 complete and 0 interrupted iterations
default   [   7% ] 2 VUs  0m08.0s/2m0s

running (0m09.0s), 2/2 VUs, 0 complete and 0 interrupted iterations
default   [   7% ] 2 VUs  0m09.0s/2m0s

running (0m10.0s), 2/2 VUs, 2 complete and 0 interrupted iterations
default   [   8% ] 2 VUs  0m10.0s/2m0s

running (0m11.0s), 2/2 VUs, 2 complete and 0 interrupted iterations
default   [   9% ] 2 VUs  0m11.0s/2m0s

running (0m12.0s), 2/2 VUs, 2 complete and 0 interrupted iterations
default   [  10% ] 2 VUs  0m12.0s/2m0s

running (0m13.0s), 2/2 VUs, 2 complete and 0 interrupted iterations
default   [  11% ] 2 VUs  0m13.0s/2m0s

running (0m14.0s), 2/2 VUs, 2 complete and 0 interrupted iterations
default   [  12% ] 2 VUs  0m14.0s/2m0s

running (0m15.0s), 2/2 VUs, 2 complete and 0 interrupted iterations
default   [  12% ] 2 VUs  0m15.0s/2m0s

running (0m16.0s), 2/2 VUs, 2 complete and 0 interrupted iterations
default   [  13% ] 2 VUs  0m16.0s/2m0s

running (0m17.0s), 2/2 VUs, 2 complete and 0 interrupted iterations
default   [  14% ] 2 VUs  0m17.0s/2m0s

running (0m18.0s), 2/2 VUs, 3 complete and 0 interrupted iterations
default   [  15% ] 2 VUs  0m18.0s/2m0s

running (0m19.0s), 2/2 VUs, 4 complete and 0 interrupted iterations
default   [  16% ] 2 VUs  0m19.0s/2m0s

running (0m20.0s), 2/2 VUs, 4 complete and 0 interrupted iterations
default   [  17% ] 2 VUs  0m20.0s/2m0s

running (0m21.0s), 2/2 VUs, 4 complete and 0 interrupted iterations
default   [  17% ] 2 VUs  0m21.0s/2m0s

running (0m22.0s), 2/2 VUs, 4 complete and 0 interrupted iterations
default   [  18% ] 2 VUs  0m22.0s/2m0s

running (0m23.0s), 2/2 VUs, 4 complete and 0 interrupted iterations
default   [  19% ] 2 VUs  0m23.0s/2m0s

running (0m24.0s), 2/2 VUs, 4 complete and 0 interrupted iterations
default   [  20% ] 2 VUs  0m24.0s/2m0s

running (0m25.0s), 2/2 VUs, 4 complete and 0 interrupted iterations
default   [  21% ] 2 VUs  0m25.0s/2m0s

running (0m26.0s), 2/2 VUs, 5 complete and 0 interrupted iterations
default   [  22% ] 2 VUs  0m26.0s/2m0s

running (0m27.0s), 2/2 VUs, 6 complete and 0 interrupted iterations
default   [  22% ] 2 VUs  0m27.0s/2m0s

running (0m28.0s), 2/2 VUs, 6 complete and 0 interrupted iterations
default   [  23% ] 2 VUs  0m28.0s/2m0s

running (0m29.0s), 2/2 VUs, 6 complete and 0 interrupted iterations
default   [  24% ] 2 VUs  0m29.0s/2m0s

running (0m30.0s), 2/2 VUs, 6 complete and 0 interrupted iterations
default   [  25% ] 2 VUs  0m30.0s/2m0s

running (0m31.0s), 2/2 VUs, 6 complete and 0 interrupted iterations
default   [  26% ] 2 VUs  0m31.0s/2m0s

running (0m32.0s), 2/2 VUs, 6 complete and 0 interrupted iterations
default   [  27% ] 2 VUs  0m32.0s/2m0s

running (0m33.0s), 2/2 VUs, 6 complete and 0 interrupted iterations
default   [  27% ] 2 VUs  0m33.0s/2m0s

running (0m34.0s), 2/2 VUs, 8 complete and 0 interrupted iterations
default   [  28% ] 2 VUs  0m34.0s/2m0s

running (0m35.0s), 2/2 VUs, 8 complete and 0 interrupted iterations
default   [  29% ] 2 VUs  0m35.0s/2m0s

running (0m36.0s), 2/2 VUs, 8 complete and 0 interrupted iterations
default   [  30% ] 2 VUs  0m36.0s/2m0s

running (0m37.0s), 2/2 VUs, 8 complete and 0 interrupted iterations
default   [  31% ] 2 VUs  0m37.0s/2m0s

running (0m38.0s), 2/2 VUs, 8 complete and 0 interrupted iterations
default   [  32% ] 2 VUs  0m38.0s/2m0s

running (0m39.0s), 2/2 VUs, 8 complete and 0 interrupted iterations
default   [  32% ] 2 VUs  0m39.0s/2m0s

running (0m40.0s), 2/2 VUs, 8 complete and 0 interrupted iterations
default   [  33% ] 2 VUs  0m40.0s/2m0s

running (0m41.0s), 2/2 VUs, 8 complete and 0 interrupted iterations
default   [  34% ] 2 VUs  0m41.0s/2m0s

running (0m42.0s), 2/2 VUs, 9 complete and 0 interrupted iterations
default   [  35% ] 2 VUs  0m42.0s/2m0s

running (0m43.0s), 2/2 VUs, 10 complete and 0 interrupted iterations
default   [  36% ] 2 VUs  0m43.0s/2m0s

running (0m44.0s), 2/2 VUs, 10 complete and 0 interrupted iterations
default   [  37% ] 2 VUs  0m44.0s/2m0s

running (0m45.0s), 2/2 VUs, 10 complete and 0 interrupted iterations
default   [  37% ] 2 VUs  0m45.0s/2m0s

running (0m46.0s), 2/2 VUs, 10 complete and 0 interrupted iterations
default   [  38% ] 2 VUs  0m46.0s/2m0s

running (0m47.0s), 2/2 VUs, 10 complete and 0 interrupted iterations
default   [  39% ] 2 VUs  0m47.0s/2m0s

running (0m48.0s), 2/2 VUs, 10 complete and 0 interrupted iterations
default   [  40% ] 2 VUs  0m48.0s/2m0s

running (0m49.0s), 2/2 VUs, 10 complete and 0 interrupted iterations
default   [  41% ] 2 VUs  0m49.0s/2m0s

running (0m50.0s), 2/2 VUs, 12 complete and 0 interrupted iterations
default   [  42% ] 2 VUs  0m50.0s/2m0s

running (0m51.0s), 2/2 VUs, 12 complete and 0 interrupted iterations
default   [  42% ] 2 VUs  0m51.0s/2m0s

running (0m52.0s), 2/2 VUs, 12 complete and 0 interrupted iterations
default   [  43% ] 2 VUs  0m52.0s/2m0s

running (0m53.0s), 2/2 VUs, 12 complete and 0 interrupted iterations
default   [  44% ] 2 VUs  0m53.0s/2m0s

running (0m54.0s), 2/2 VUs, 12 complete and 0 interrupted iterations
default   [  45% ] 2 VUs  0m54.0s/2m0s

running (0m55.0s), 2/2 VUs, 12 complete and 0 interrupted iterations
default   [  46% ] 2 VUs  0m55.0s/2m0s

running (0m56.0s), 2/2 VUs, 12 complete and 0 interrupted iterations
default   [  47% ] 2 VUs  0m56.0s/2m0s

running (0m57.0s), 2/2 VUs, 12 complete and 0 interrupted iterations
default   [  47% ] 2 VUs  0m57.0s/2m0s

running (0m58.0s), 2/2 VUs, 13 complete and 0 interrupted iterations
default   [  48% ] 2 VUs  0m58.0s/2m0s

running (0m59.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
default   [  49% ] 2 VUs  0m59.0s/2m0s

running (1m00.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
default   [  50% ] 2 VUs  1m00.0s/2m0s

running (1m01.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
default   [  51% ] 2 VUs  1m01.0s/2m0s

running (1m02.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
default   [  52% ] 2 VUs  1m02.0s/2m0s

running (1m03.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
default   [  52% ] 2 VUs  1m03.0s/2m0s

running (1m04.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
default   [  53% ] 2 VUs  1m04.0s/2m0s

running (1m05.0s), 2/2 VUs, 15 complete and 0 interrupted iterations
default   [  54% ] 2 VUs  1m05.0s/2m0s

running (1m06.0s), 2/2 VUs, 15 complete and 0 interrupted iterations
default   [  55% ] 2 VUs  1m06.0s/2m0s

running (1m07.0s), 2/2 VUs, 16 complete and 0 interrupted iterations
default   [  56% ] 2 VUs  1m07.0s/2m0s

running (1m08.0s), 2/2 VUs, 16 complete and 0 interrupted iterations
default   [  57% ] 2 VUs  1m08.0s/2m0s

running (1m09.0s), 2/2 VUs, 16 complete and 0 interrupted iterations
default   [  57% ] 2 VUs  1m09.0s/2m0s

running (1m10.0s), 2/2 VUs, 16 complete and 0 interrupted iterations
default   [  58% ] 2 VUs  1m10.0s/2m0s

running (1m11.0s), 2/2 VUs, 16 complete and 0 interrupted iterations
default   [  59% ] 2 VUs  1m11.0s/2m0s

running (1m12.0s), 2/2 VUs, 16 complete and 0 interrupted iterations
default   [  60% ] 2 VUs  1m12.0s/2m0s

running (1m13.0s), 2/2 VUs, 17 complete and 0 interrupted iterations
default   [  61% ] 2 VUs  1m13.0s/2m0s

running (1m14.0s), 2/2 VUs, 18 complete and 0 interrupted iterations
default   [  62% ] 2 VUs  1m14.0s/2m0s

running (1m15.0s), 2/2 VUs, 18 complete and 0 interrupted iterations
default   [  62% ] 2 VUs  1m15.0s/2m0s

running (1m16.0s), 2/2 VUs, 18 complete and 0 interrupted iterations
default   [  63% ] 2 VUs  1m16.0s/2m0s

running (1m17.0s), 2/2 VUs, 18 complete and 0 interrupted iterations
default   [  64% ] 2 VUs  1m17.0s/2m0s

running (1m18.0s), 2/2 VUs, 18 complete and 0 interrupted iterations
default   [  65% ] 2 VUs  1m18.0s/2m0s

running (1m19.0s), 2/2 VUs, 18 complete and 0 interrupted iterations
default   [  66% ] 2 VUs  1m19.0s/2m0s

running (1m20.0s), 2/2 VUs, 18 complete and 0 interrupted iterations
default   [  67% ] 2 VUs  1m20.0s/2m0s

running (1m21.0s), 2/2 VUs, 19 complete and 0 interrupted iterations
default   [  67% ] 2 VUs  1m21.0s/2m0s

running (1m22.0s), 2/2 VUs, 20 complete and 0 interrupted iterations
default   [  68% ] 2 VUs  1m22.0s/2m0s

running (1m23.0s), 2/2 VUs, 20 complete and 0 interrupted iterations
default   [  69% ] 2 VUs  1m23.0s/2m0s

running (1m24.0s), 2/2 VUs, 20 complete and 0 interrupted iterations
default   [  70% ] 2 VUs  1m24.0s/2m0s

running (1m25.0s), 2/2 VUs, 20 complete and 0 interrupted iterations
default   [  71% ] 2 VUs  1m25.0s/2m0s

running (1m26.0s), 2/2 VUs, 20 complete and 0 interrupted iterations
default   [  72% ] 2 VUs  1m26.0s/2m0s

running (1m27.0s), 2/2 VUs, 20 complete and 0 interrupted iterations
default   [  72% ] 2 VUs  1m27.0s/2m0s

running (1m28.0s), 2/2 VUs, 20 complete and 0 interrupted iterations
default   [  73% ] 2 VUs  1m28.0s/2m0s

running (1m29.0s), 2/2 VUs, 21 complete and 0 interrupted iterations
default   [  74% ] 2 VUs  1m29.0s/2m0s

running (1m30.0s), 2/2 VUs, 22 complete and 0 interrupted iterations
default   [  75% ] 2 VUs  1m30.0s/2m0s

running (1m31.0s), 2/2 VUs, 22 complete and 0 interrupted iterations
default   [  76% ] 2 VUs  1m31.0s/2m0s

running (1m32.0s), 2/2 VUs, 22 complete and 0 interrupted iterations
default   [  77% ] 2 VUs  1m32.0s/2m0s

running (1m33.0s), 2/2 VUs, 22 complete and 0 interrupted iterations
default   [  77% ] 2 VUs  1m33.0s/2m0s

running (1m34.0s), 2/2 VUs, 22 complete and 0 interrupted iterations
default   [  78% ] 2 VUs  1m34.0s/2m0s

running (1m35.0s), 2/2 VUs, 22 complete and 0 interrupted iterations
default   [  79% ] 2 VUs  1m35.0s/2m0s

running (1m36.0s), 2/2 VUs, 22 complete and 0 interrupted iterations
default   [  80% ] 2 VUs  1m36.0s/2m0s

running (1m37.0s), 2/2 VUs, 23 complete and 0 interrupted iterations
default   [  81% ] 2 VUs  1m37.0s/2m0s

running (1m38.0s), 2/2 VUs, 24 complete and 0 interrupted iterations
default   [  82% ] 2 VUs  1m38.0s/2m0s

running (1m39.0s), 2/2 VUs, 24 complete and 0 interrupted iterations
default   [  82% ] 2 VUs  1m39.0s/2m0s

running (1m40.0s), 2/2 VUs, 24 complete and 0 interrupted iterations
default   [  83% ] 2 VUs  1m40.0s/2m0s

running (1m41.0s), 2/2 VUs, 24 complete and 0 interrupted iterations
default   [  84% ] 2 VUs  1m41.0s/2m0s

running (1m42.0s), 2/2 VUs, 24 complete and 0 interrupted iterations
default   [  85% ] 2 VUs  1m42.0s/2m0s

running (1m43.0s), 2/2 VUs, 24 complete and 0 interrupted iterations
default   [  86% ] 2 VUs  1m43.0s/2m0s

running (1m44.0s), 2/2 VUs, 24 complete and 0 interrupted iterations
default   [  87% ] 2 VUs  1m44.0s/2m0s

running (1m45.0s), 2/2 VUs, 24 complete and 0 interrupted iterations
default   [  87% ] 2 VUs  1m45.0s/2m0s

running (1m46.0s), 2/2 VUs, 25 complete and 0 interrupted iterations
default   [  88% ] 2 VUs  1m46.0s/2m0s

running (1m47.0s), 2/2 VUs, 26 complete and 0 interrupted iterations
default   [  89% ] 2 VUs  1m47.0s/2m0s

running (1m48.0s), 2/2 VUs, 26 complete and 0 interrupted iterations
default   [  90% ] 2 VUs  1m48.0s/2m0s

running (1m49.0s), 2/2 VUs, 26 complete and 0 interrupted iterations
default   [  91% ] 2 VUs  1m49.0s/2m0s

running (1m50.0s), 2/2 VUs, 26 complete and 0 interrupted iterations
default   [  92% ] 2 VUs  1m50.0s/2m0s

running (1m51.0s), 2/2 VUs, 26 complete and 0 interrupted iterations
default   [  92% ] 2 VUs  1m51.0s/2m0s

running (1m52.0s), 2/2 VUs, 26 complete and 0 interrupted iterations
default   [  93% ] 2 VUs  1m52.0s/2m0s

running (1m53.0s), 2/2 VUs, 26 complete and 0 interrupted iterations
default   [  94% ] 2 VUs  1m53.0s/2m0s

running (1m54.0s), 2/2 VUs, 27 complete and 0 interrupted iterations
default   [  95% ] 2 VUs  1m54.0s/2m0s

running (1m55.0s), 2/2 VUs, 28 complete and 0 interrupted iterations
default   [  96% ] 2 VUs  1m55.0s/2m0s

running (1m56.0s), 2/2 VUs, 28 complete and 0 interrupted iterations
default   [  97% ] 2 VUs  1m56.0s/2m0s

running (1m57.0s), 2/2 VUs, 28 complete and 0 interrupted iterations
default   [  97% ] 2 VUs  1m57.0s/2m0s

running (1m58.0s), 2/2 VUs, 28 complete and 0 interrupted iterations
default   [  98% ] 2 VUs  1m58.0s/2m0s

running (1m59.0s), 2/2 VUs, 28 complete and 0 interrupted iterations
default   [  99% ] 2 VUs  1m59.0s/2m0s

running (2m00.0s), 2/2 VUs, 28 complete and 0 interrupted iterations
default   [ 100% ] 2 VUs  2m00.0s/2m0s

running (2m01.0s), 2/2 VUs, 28 complete and 0 interrupted iterations
default Ôåô [ 100% ] 2 VUs  2m0s

running (2m02.0s), 1/2 VUs, 29 complete and 0 interrupted iterations
default Ôåô [ 100% ] 2 VUs  2m0s

     Ôûê Smoke ÔÇö Health

       Ô£ô health ÔÇö HTTP 200
       Ô£ù health/ready ÔÇö HTTP 200
        Ôå│  0% ÔÇö Ô£ô 0 / Ô£ù 30

     Ôûê Smoke ÔÇö Product List

       Ô£ô smoke_products ÔÇö HTTP 2xx
       Ô£ô products ÔÇö success
       Ô£ô products ÔÇö has items

     Ôûê Smoke ÔÇö Categories

       Ô£ô smoke_categories ÔÇö HTTP 2xx
       Ô£ô categories ÔÇö success

     Ôûê Smoke ÔÇö Collections

       Ô£ô smoke_collections ÔÇö HTTP 2xx
       Ô£ô collections ÔÇö success

     Ôûê Smoke ÔÇö Search

       Ô£ô smoke_search ÔÇö HTTP 2xx
       Ô£ô search ÔÇö success

     Ôûê Smoke ÔÇö Homepage

       Ô£ô smoke_homepage ÔÇö HTTP 2xx
       Ô£ô homepage ÔÇö success

     Ôûê Smoke ÔÇö Cart

       Ô£ô smoke_cart ÔÇö HTTP 2xx
       Ô£ô cart ÔÇö success

     Ôûê Smoke ÔÇö Trending

       Ô£ô smoke_trending ÔÇö HTTP 2xx
       Ô£ô trending ÔÇö success

     api_latency....................: avg=729.56ms min=288.81ms med=513.42ms max=1.81s   p(90)=1.33s  p(95)=1.34s
     api_success_rate...............: 100.00% 210 out of 210
     checks.........................: 94.11%  480 out of 510
     data_received..................: 3.5 MB  29 kB/s
     data_sent......................: 30 kB   242 B/s
     group_duration.................: avg=1.01s    min=288.81ms med=928.8ms  max=3.21s   p(90)=2.98s  p(95)=3s   
     http_req_blocked...............: avg=85.21┬Ás  min=0s       med=0s       max=10.95ms p(90)=0s     p(95)=0s   
     http_req_connecting............: avg=3.88┬Ás   min=0s       med=0s       max=525┬Ás   p(90)=0s     p(95)=0s   
   Ô£ù http_req_duration..............: avg=902.69ms min=0s       med=513.42ms max=3.21s   p(90)=2.98s  p(95)=3s   
       { expected_response:true }...: avg=638.62ms min=0s       med=494.77ms max=1.81s   p(90)=1.32s  p(95)=1.34s
   Ô£ù http_req_failed................: 11.11%  30 out of 270
     http_req_receiving.............: avg=1.13ms   min=0s       med=576.24┬Ás max=11.59ms p(90)=2.84ms p(95)=5.9ms
     http_req_sending...............: avg=11.41┬Ás  min=0s       med=0s       max=525┬Ás   p(90)=0s     p(95)=0s   
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s      p(90)=0s     p(95)=0s   
     http_req_waiting...............: avg=901.54ms min=0s       med=512.89ms max=3.21s   p(90)=2.98s  p(95)=3s   
     http_reqs......................: 270     2.209111/s
     iteration_duration.............: avg=8.13s    min=7.8s     med=7.96s    max=9.18s   p(90)=8.8s   p(95)=8.99s
     iterations.....................: 30      0.245457/s
     vus............................: 1       min=1          max=2
     vus_max........................: 2       min=2          max=2


running (2m02.2s), 0/2 VUs, 30 complete and 0 interrupted iterations
default Ô£ô [ 100% ] 2 VUs  2m0s
k6.exe : time="2026-07-16T17:20:19+05:30" level=error msg="thresholds on metrics 'http_req_duration, http_req_failed' 
have been crossed"
At line:1 char:11
+ $Output = & "C:\Users\Admin\AppData\Local\Temp\k6.exe" run "F:\Work\H ...
+           ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    + CategoryInfo          : NotSpecified: (time="2026-07-1...e been crossed":String) [], RemoteException
    + FullyQualifiedErrorId : NativeCommandError